fduan001/F2812_SAMPLER/INCDIR/HF2812/DSP28_ECan.h
};

/* Allow access to the bit fields or entire register */
union CANTRS_REG
{
    UINT32        all;
    struct CANTRS_BITS  bit;
};

/* eCAN Transmit Request Reset register (CANTRR) bit definitions */
struct  CANTRR_BITS              // bit  description
{
    UINT16      TRR0: 1;    // 0   TRR for Mailbox 0
    UINT16      TRR1: 1;    // 1   TRR for Mailbox 1
    UINT16      TRR2: 1;    // 2   TRR for Mailbox 2
    UINT16      TRR3: 1;    // 3   TRR for Mailbox 3
    UINT16      TRR4: 1;    // 4   TRR for Mailbox 4
    UINT16      TRR5: 1;    // 5   TRR for Mailbox 5
    UINT16      TRR6: 1;    // 6   TRR for Mailbox 6
    UINT16      TRR7: 1;    // 7   TRR for Mailbox 7
    UINT16      TRR8: 1;    // 8   TRR for Mailbox 8
    UINT16      TRR9: 1;    // 9   TRR for Mailbox 9
    UINT16      TRR10: 1;   // 10  TRR for Mailbox 10
    UINT16      TRR11: 1;   // 11  TRR for Mailbox 11
    UINT16      TRR12: 1;   // 12  TRR for Mailbox 12
    UINT16      TRR13: 1;   // 13  TRR for Mailbox 13
    UINT16      TRR14: 1;   // 14  TRR for Mailbox 14
    UINT16      TRR15: 1;   // 15  TRR for Mailbox 15
    UINT16      TRR16: 1;   // 16  TRR for Mailbox 16
    UINT16      TRR17: 1;   // 17  TRR for Mailbox 17
    UINT16      TRR18: 1;   // 18  TRR for Mailbox 18
    UINT16      TRR19: 1;   // 19  TRR for Mailbox 19
    UINT16      TRR20: 1;   // 20  TRR for Mailbox 20
    UINT16      TRR21: 1;   // 21  TRR for Mailbox 21
    UINT16      TRR22: 1;   // 22  TRR for Mailbox 22
    UINT16      TRR23: 1;   // 23  TRR for Mailbox 23
    UINT16      TRR24: 1;   // 24  TRR for Mailbox 24
    UINT16      TRR25: 1;   // 25  TRR for Mailbox 25
    UINT16      TRR26: 1;   // 26  TRR for Mailbox 26
    UINT16      TRR27: 1;   // 27  TRR for Mailbox 27
    UINT16      TRR28: 1;   // 28  TRR for Mailbox 28
    UINT16      TRR29: 1;   // 29  TRR for Mailbox 29
    UINT16      TRR30: 1;   // 30  TRR for Mailbox 30
    UINT16      TRR31: 1;   // 31  TRR for Mailbox 31

};

/* Allow access to the bit fields or entire register */
union CANTRR_REG
{
    UINT32        all;
    struct CANTRR_BITS  bit;
};

/* eCAN Transmit Acknowledge register (CANTA) bit definitions */
struct  CANTA_BITS              // bit  description
{
    UINT16      TA0: 1;    // 0   TA for Mailbox 0
    UINT16      TA1: 1;    // 1   TA for Mailbox 1
    UINT16      TA2: 1;    // 2   TA for Mailbox 2
    UINT16      TA3: 1;    // 3   TA for Mailbox 3
    UINT16      TA4: 1;    // 4   TA for Mailbox 4
    UINT16      TA5: 1;    // 5   TA for Mailbox 5
    UINT16      TA6: 1;    // 6   TA for Mailbox 6
    UINT16      TA7: 1;    // 7   TA for Mailbox 7
    UINT16      TA8: 1;    // 8   TA for Mailbox 8
    UINT16      TA9: 1;    // 9   TA for Mailbox 9
    UINT16      TA10: 1;   // 10  TA for Mailbox 10
    UINT16      TA11: 1;   // 11  TA for Mailbox 11
    UINT16      TA12: 1;   // 12  TA for Mailbox 12
    UINT16      TA13: 1;   // 13  TA for Mailbox 13
    UINT16      TA14: 1;   // 14  TA for Mailbox 14
    UINT16      TA15: 1;   // 15  TA for Mailbox 15
    UINT16      TA16: 1;   // 16  TA for Mailbox 16
    UINT16      TA17: 1;   // 17  TA for Mailbox 17
    UINT16      TA18: 1;   // 18  TA for Mailbox 18
    UINT16      TA19: 1;   // 19  TA for Mailbox 19
    UINT16      TA20: 1;   // 20  TA for Mailbox 20
    UINT16      TA21: 1;   // 21  TA for Mailbox 21
    UINT16      TA22: 1;   // 22  TA for Mailbox 22
    UINT16      TA23: 1;   // 23  TA for Mailbox 23
    UINT16      TA24: 1;   // 24  TA for Mailbox 24
    UINT16      TA25: 1;   // 25  TA for Mailbox 25
    UINT16      TA26: 1;   // 26  TA for Mailbox 26
    UINT16      TA27: 1;   // 27  TA for Mailbox 27
    UINT16      TA28: 1;   // 28  TA for Mailbox 28
    UINT16      TA29: 1;   // 29  TA for Mailbox 29
    UINT16      TA30: 1;   // 30  TA for Mailbox 30
    UINT16      TA31: 1;   // 31  TA for Mailbox 31

};

/* Allow access to the bit fields or entire register */
union CANTA_REG
{
    UINT32        all;
    struct CANTA_BITS  bit;
};

/* eCAN Transmit Abort Acknowledge register (CANAA) bit definitions */
struct  CANAA_BITS              // bit  description
{
    UINT16      AA0: 1;    // 0   AA for Mailbox 0
    UINT16      AA1: 1;    // 1   AA for Mailbox 1
    UINT16      AA2: 1;    // 2   AA for Mailbox 2
    UINT16      AA3: 1;    // 3   AA for Mailbox 3
    UINT16      AA4: 1;    // 4   AA for Mailbox 4
    UINT16      AA5: 1;    // 5   AA for Mailbox 5
    UINT16      AA6: 1;    // 6   AA for Mailbox 6
    UINT16      AA7: 1;    // 7   AA for Mailbox 7
    UINT16      AA8: 1;    // 8   AA for Mailbox 8
    UINT16      AA9: 1;    // 9   AA for Mailbox 9
    UINT16      AA10: 1;   // 10  AA for Mailbox 10
    UINT16      AA11: 1;   // 11  AA for Mailbox 11
    UINT16      AA12: 1;   // 12  AA for Mailbox 12
    UINT16      AA13: 1;   // 13  AA for Mailbox 13
    UINT16      AA14: 1;   // 14  AA for Mailbox 14
    UINT16      AA15: 1;   // 15  AA for Mailbox 15
    UINT16      AA16: 1;   // 16  AA for Mailbox 16
    UINT16      AA17: 1;   // 17  AA for Mailbox 17
    UINT16      AA18: 1;   // 18  AA for Mailbox 18
    UINT16      AA19: 1;   // 19  AA for Mailbox 19
    UINT16      AA20: 1;   // 20  AA for Mailbox 20
    UINT16      AA21: 1;   // 21  AA for Mailbox 21
    UINT16      AA22: 1;   // 22  AA for Mailbox 22
    UINT16      AA23: 1;   // 23  AA for Mailbox 23
    UINT16      AA24: 1;   // 24  AA for Mailbox 24
    UINT16      AA25: 1;   // 25  AA for Mailbox 25
    UINT16      AA26: 1;   // 26  AA for Mailbox 26
    UINT16      AA27: 1;   // 27  AA for Mailbox 27
    UINT16      AA28: 1;   // 28  AA for Mailbox 28
    UINT16      AA29: 1;   // 29  AA for Mailbox 29
    UINT16      AA30: 1;   // 30  AA for Mailbox 30
    UINT16      AA31: 1;   // 31  AA for Mailbox 31

};

/* Allow access to the bit fields or entire register */
union CANAA_REG
{
    UINT32        all;
    struct CANAA_BITS  bit;
};

/* eCAN Received Message Pending register (CANRMP) bit definitions */
struct  CANRMP_BITS              // bit  description
{
    UINT16      RMP0: 1;    // 0   RMP for Mailbox 0
    UINT16      RMP1: 1;    // 1   RMP for Mailbox 1
    UINT16      RMP2: 1;    // 2   RMP for Mailbox 2
    UINT16      RMP3: 1;    // 3   RMP for Mailbox 3
    UINT16      RMP4: 1;    // 4   RMP for Mailbox 4
    UINT16      RMP5: 1;    // 5   RMP for Mailbox 5
    UINT16      RMP6: 1;    // 6   RMP for Mailbox 6
    UINT16      RMP7: 1;    // 7   RMP for Mailbox 7
    UINT16      RMP8: 1;    // 8   RMP for Mailbox 8
    UINT16      RMP9: 1;    // 9   RMP for Mailbox 9
    UINT16      RMP10: 1;   // 10  RMP for Mailbox 10
    UINT16      RMP11: 1;   // 11  RMP for Mailbox 11
    UINT16      RMP12: 1;   // 12  RMP for Mailbox 12
    UINT16      RMP13: 1;   // 13  RMP for Mailbox 13
    UINT16      RMP14: 1;   // 14  RMP for Mailbox 14
    UINT16      RMP15: 1;   // 15  RMP for Mailbox 15
    UINT16      RMP16: 1;   // 16  RMP for Mailbox 16
    UINT16      RMP17: 1;   // 17  RMP for Mailbox 17
    UINT16      RMP18: 1;   // 18  RMP for Mailbox 18
    UINT16      RMP19: 1;   // 19  RMP for Mailbox 19
    UINT16      RMP20: 1;   // 20  RMP for Mailbox 20
    UINT16      RMP21: 1;   // 21  RMP for Mailbox 21
    UINT16      RMP22: 1;   // 22  RMP for Mailbox 22
    UINT16      RMP23: 1;   // 23  RMP for Mailbox 23
    UINT16      RMP24: 1;   // 24  RMP for Mailbox 24
    UINT16      RMP25: 1;   // 25  RMP for Mailbox 25
    UINT16      RMP26: 1;   // 26  RMP for Mailbox 26
    UINT16      RMP27: 1;   // 27  RMP for Mailbox 27
    UINT16      RMP28: 1;   // 28  RMP for Mailbox 28
    UINT16      RMP29: 1;   // 29  RMP for Mailbox 29
    UINT16      RMP30: 1;   // 30  RMP for Mailbox 30
    UINT16      RMP31: 1;   // 31  RMP for Mailbox 31

