fduan001/F2812_SAMPLER/INCDIR/HF2812/DSP28_ECan.h
};

/* Allow access to the bit fields or entire register */
union CANRMP_REG
{
    UINT32        all;
    struct CANRMP_BITS  bit;
};

/* eCAN Received Message Lost register (CANRML) bit definitions */
struct  CANRML_BITS              // bit  description
{
    UINT16      RML0: 1;    // 0   RML for Mailbox 0
    UINT16      RML1: 1;    // 1   RML for Mailbox 1
    UINT16      RML2: 1;    // 2   RML for Mailbox 2
    UINT16      RML3: 1;    // 3   RML for Mailbox 3
    UINT16      RML4: 1;    // 4   RML for Mailbox 4
    UINT16      RML5: 1;    // 5   RML for Mailbox 5
    UINT16      RML6: 1;    // 6   RML for Mailbox 6
    UINT16      RML7: 1;    // 7   RML for Mailbox 7
    UINT16      RML8: 1;    // 8   RML for Mailbox 8
    UINT16      RML9: 1;    // 9   RML for Mailbox 9
    UINT16      RML10: 1;   // 10  RML for Mailbox 10
    UINT16      RML11: 1;   // 11  RML for Mailbox 11
    UINT16      RML12: 1;   // 12  RML for Mailbox 12
    UINT16      RML13: 1;   // 13  RML for Mailbox 13
    UINT16      RML14: 1;   // 14  RML for Mailbox 14
    UINT16      RML15: 1;   // 15  RML for Mailbox 15
    UINT16      RML16: 1;   // 16  RML for Mailbox 16
    UINT16      RML17: 1;   // 17  RML for Mailbox 17
    UINT16      RML18: 1;   // 18  RML for Mailbox 18
    UINT16      RML19: 1;   // 19  RML for Mailbox 19
    UINT16      RML20: 1;   // 20  RML for Mailbox 20
    UINT16      RML21: 1;   // 21  RML for Mailbox 21
    UINT16      RML22: 1;   // 22  RML for Mailbox 22
    UINT16      RML23: 1;   // 23  RML for Mailbox 23
    UINT16      RML24: 1;   // 24  RML for Mailbox 24
    UINT16      RML25: 1;   // 25  RML for Mailbox 25
    UINT16      RML26: 1;   // 26  RML for Mailbox 26
    UINT16      RML27: 1;   // 27  RML for Mailbox 27
    UINT16      RML28: 1;   // 28  RML for Mailbox 28
    UINT16      RML29: 1;   // 29  RML for Mailbox 29
    UINT16      RML30: 1;   // 30  RML for Mailbox 30
    UINT16      RML31: 1;   // 31  RML for Mailbox 31

};

/* Allow access to the bit fields or entire register */
union CANRML_REG
{
    UINT32        all;
    struct CANRML_BITS  bit;
};

/* eCAN Remote Frame Pending register (CANRFP) bit definitions */
struct  CANRFP_BITS              // bit  description
{
    UINT16      RFP0: 1;    // 0   RFP for Mailbox 0
    UINT16      RFP1: 1;    // 1   RFP for Mailbox 1
    UINT16      RFP2: 1;    // 2   RFP for Mailbox 2
    UINT16      RFP3: 1;    // 3   RFP for Mailbox 3
    UINT16      RFP4: 1;    // 4   RFP for Mailbox 4
    UINT16      RFP5: 1;    // 5   RFP for Mailbox 5
    UINT16      RFP6: 1;    // 6   RFP for Mailbox 6
    UINT16      RFP7: 1;    // 7   RFP for Mailbox 7
    UINT16      RFP8: 1;    // 8   RFP for Mailbox 8
    UINT16      RFP9: 1;    // 9   RFP for Mailbox 9
    UINT16      RFP10: 1;   // 10  RFP for Mailbox 10
    UINT16      RFP11: 1;   // 11  RFP for Mailbox 11
    UINT16      RFP12: 1;   // 12  RFP for Mailbox 12
    UINT16      RFP13: 1;   // 13  RFP for Mailbox 13
    UINT16      RFP14: 1;   // 14  RFP for Mailbox 14
    UINT16      RFP15: 1;   // 15  RFP for Mailbox 15
    UINT16      RFP16: 1;   // 16  RFP for Mailbox 16
    UINT16      RFP17: 1;   // 17  RFP for Mailbox 17
    UINT16      RFP18: 1;   // 18  RFP for Mailbox 18
    UINT16      RFP19: 1;   // 19  RFP for Mailbox 19
    UINT16      RFP20: 1;   // 20  RFP for Mailbox 20
    UINT16      RFP21: 1;   // 21  RFP for Mailbox 21
    UINT16      RFP22: 1;   // 22  RFP for Mailbox 22
    UINT16      RFP23: 1;   // 23  RFP for Mailbox 23
    UINT16      RFP24: 1;   // 24  RFP for Mailbox 24
    UINT16      RFP25: 1;   // 25  RFP for Mailbox 25
    UINT16      RFP26: 1;   // 26  RFP for Mailbox 26
    UINT16      RFP27: 1;   // 27  RFP for Mailbox 27
    UINT16      RFP28: 1;   // 28  RFP for Mailbox 28
    UINT16      RFP29: 1;   // 29  RFP for Mailbox 29
    UINT16      RFP30: 1;   // 30  RFP for Mailbox 30
    UINT16      RFP31: 1;   // 31  RFP for Mailbox 31

};

/* Allow access to the bit fields or entire register */
union CANRFP_REG
{
    UINT32       all;
    struct CANRFP_BITS  bit;
};

/* eCAN Global Acceptance Mask register (CANGAM) bit definitions */
struct  CANGAM_BITS              // bits  description
{
    UINT16      GAM150: 16; // 15:0
    UINT16      GAM2816: 13; // 28:16
    UINT16 rsvd: 2;         // 30:29
    UINT16      AMI: 1;     // 31    AMI bit
};

/* Allow access to the bit fields or entire register */
union CANGAM_REG
{
    UINT32        all;
    struct CANGAM_BITS  bit;
};


/* eCAN Master Control register (CANMC) bit definitions */
struct  CANMC_BITS              // bits  description
{
    UINT16      MBNR: 5;    // 4:0   MBX # for CDR bit
    UINT16      SRES: 1;    // 5     Soft reset
    UINT16      STM: 1;     // 6     Self-test mode
    UINT16      ABO: 1;     // 7     Auto bus-on
    UINT16      CDR: 1;     // 8     Change data request
    UINT16      WUBA: 1;    // 9     Wake-up on bus activity
    UINT16      DBO: 1;     // 10    Data-byte order
    UINT16      PDR: 1;     // 11    Power-down mode request
    UINT16      CCR: 1;     // 12    Change configuration request
    UINT16      SCM: 1;     // 13    SCC compatibility mode
    UINT16      LNTM: 1;    // 14    LNT MSB clear bit
    UINT16      LNTC: 1;    // 15    LNT clear bit thru mailbox 16
    UINT16      SUSP: 1;    // 16    SUSPEND free/soft bit
    UINT16 rsvd: 15;        // 31:17  reserved
};

/* Allow access to the bit fields or entire register */
union CANMC_REG
{
    UINT32        all;
    struct CANMC_BITS  bit;
};

/* eCAN Bit -timing configuration register (CANBTC) bit definitions */
struct  CANBTC_BITS              // bits  description
{
    UINT16      TSEG2: 3;   // 2:0   TSEG2
    UINT16      TSEG1: 4;   // 6:3   TSEG1
    UINT16      SAM: 1;     // 7     Sample-point setting
    UINT16      SJW: 2;     // 9:8   Synchroniztion Jump Width
    UINT16      ERM: 1;     // 10    Edge resynchroniztion mode
    UINT16 rsvd1: 5;        // 15:11 reserved
    UINT16      BRP: 8;     // 23:16 Time quantum prescaler
    UINT16 rsvd2: 8;        // 31:24   reserved
};

/* Allow access to the bit fields or entire register */
union CANBTC_REG
{
    UINT32        all;
    struct CANBTC_BITS  bit;
};

/* eCAN Error & Status register (CANES) bit definitions */
struct  CANES_BITS               // bits  description
{
    UINT16      TM: 1;      // 0   TM
    UINT16      RM: 1;      // 1   RM
    UINT16 rsvd1: 1;        // 2 reserved
    UINT16      PDA: 1;     // 3   Power-down acknowledge
    UINT16      CCE: 1;     // 4   Change Configuration Enable
    UINT16      SMA: 1;     // 5   Suspend Mode Acknowledge
    UINT16 rsvd2: 10;       // 15:6   reserved
    UINT16      EW: 1;      // 16  EW
    UINT16      EP: 1;      // 17  EP
    UINT16      BO: 1;      // 18  BO
    UINT16      ACKE: 1;    // 19  ACKE
    UINT16      SE: 1;      // 20  SE
    UINT16      CRCE: 1;    // 21  CRCE
    UINT16      SA1: 1;     // 22  SA1
    UINT16      BE: 1;      // 23  BE
    UINT16      FE: 1;      // 24  FE
    UINT16 rsvd3: 7;        // 31:25   reserved
};

/* Allow access to the bit fields or entire register */
union CANES_REG
{
    UINT32        all;
    struct CANES_BITS  bit;
};


