fduan001/F2812_SAMPLER/INCDIR/HF2812/DSP28_ECan.h
/* eCAN Transmit Error Counter register (CANTEC) bit definitions */
struct  CANTEC_BITS              // bits  description
{
    UINT16      TEC: 8;     // 7:0   TEC
    UINT16 rsvd1: 8;        // 15:8  reserved
    UINT16 rsvd2: 16;       // 31:16  reserved
};

/* Allow access to the bit fields or entire register */
union CANTEC_REG
{
    UINT32        all;
    struct CANTEC_BITS  bit;
};

/* eCAN Receive Error Counter register (CANREC) bit definitions */
struct  CANREC_BITS              // bits  description
{
    UINT16      REC: 8;     // 7:0   REC
    UINT16 rsvd1: 8;        // 15:8  reserved
    UINT16 rsvd2: 16;       // 31:16  reserved
};

/* Allow access to the bit fields or entire register */
union CANREC_REG
{
    UINT32        all;
    struct CANREC_BITS  bit;
};

/* eCAN Global Interrupt Flag 0 (CANGIF0) bit definitions */
struct  CANGIF0_BITS             // bits  description
{
    UINT16      MIV0: 5;    // 4:0   Mailbox Interrupt Vector
    UINT16 rsvd1: 3;        // 7:5   reserved
    UINT16      WLIF0: 1;   // 8   WLIF0
    UINT16      EPIF0: 1;   // 9   EPIF0
    UINT16      BOIF0: 1;   // 10  BOIF0
    UINT16      RMLIF0: 1;  // 11  RMLIF0
    UINT16      WUIF0: 1;   // 12  WUIF0
    UINT16      WDIF0: 1;   // 13  WDIF0
    UINT16      AAIF0: 1;   // 14  AAIF0
    UINT16      GMIF0: 1;   // 15  GMIF0
    UINT16      TCOIF0: 1;  // 16  TCOIF0
    UINT16      MAIF0: 1;   // 17  MAIF0
    UINT16 rsvd2: 14;       // 31:18   reserved
};

/* Allow access to the bit fields or entire register */
union CANGIF0_REG
{
    UINT32        all;
    struct CANGIF0_BITS  bit;
};

/* eCAN Global Interrupt Mask register (CANGIM) bit definitions */
struct  CANGIM_BITS             // bits  description
{
    UINT16      I0EN: 1;    // 0   Interrupt 0 enable
    UINT16      I1EN: 1;    // 1   Interrupt 1 enable
    UINT16      SIL: 1;     // 2   System Interrupt Level
    UINT16 rsvd1: 5;        // 7:3   reserved
    UINT16      WLIM: 1;   // 8   WLIM
    UINT16      EPIM: 1;   // 9   EPIM
    UINT16      BOIM: 1;   // 10  BOIM
    UINT16      RMLIM: 1;  // 11  RMLIM
    UINT16      WUIM: 1;   // 12  WUIM
    UINT16      WDIM: 1;   // 13  WDIM
    UINT16      AAIM: 1;   // 14  AAIM
    UINT16 rsvd2: 1;        // 15  reserved
    UINT16      TCOIM: 1;  // 16  TCOIM
    UINT16      MAIM: 1;   // 17  MAIM
    UINT16 rsvd3: 14;       // 31:18   reserved
};

/* Allow access to the bit fields or entire register */
union CANGIM_REG
{
    UINT32        all;
    struct CANGIM_BITS  bit;
};


/* eCAN Global Interrupt Flag 1 (eCANGIF1) bit definitions */
struct  CANGIF1_BITS             // bits  description
{
    UINT16      MIV1: 5;    // 4:0   Mailbox Interrupt Vector
    UINT16 rsvd1: 3;        // 7:5   reserved
    UINT16      WLIF1: 1;   // 8   WLIF1
    UINT16      EPIF1: 1;   // 9   EPIF1
    UINT16      BOIF1: 1;   // 11  BOIF1
    UINT16      RMLIF1: 1;  // 11  RMLIF1
    UINT16      WUIF1: 1;   // 12  WUIF1
    UINT16      WDIF1: 1;   // 13  WDIF1
    UINT16      AAIF1: 1;   // 14  AAIF1
    UINT16      GMIF1: 1;   // 15  GMIF1
    UINT16      TCOIF1: 1;  // 16  TCOIF1
    UINT16      MAIF1: 1;   // 17  MAIF1
    UINT16 rsvd2: 14;       // 31:18   reserved
};

/* Allow access to the bit fields or entire register */
union CANGIF1_REG
{
    UINT32        all;
    struct CANGIF1_BITS  bit;
};


/* eCAN Mailbox Interrupt Mask register (CANMIM) bit definitions */
struct  CANMIM_BITS              // bit  description
{
    UINT16      MIM0: 1;    // 0   MIM for Mailbox 0
    UINT16      MIM1: 1;    // 1   MIM for Mailbox 1
    UINT16      MIM2: 1;    // 2   MIM for Mailbox 2
    UINT16      MIM3: 1;    // 3   MIM for Mailbox 3
    UINT16      MIM4: 1;    // 4   MIM for Mailbox 4
    UINT16      MIM5: 1;    // 5   MIM for Mailbox 5
    UINT16      MIM6: 1;    // 6   MIM for Mailbox 6
    UINT16      MIM7: 1;    // 7   MIM for Mailbox 7
    UINT16      MIM8: 1;    // 8   MIM for Mailbox 8
    UINT16      MIM9: 1;    // 9   MIM for Mailbox 9
    UINT16      MIM10: 1;   // 10  MIM for Mailbox 10
    UINT16      MIM11: 1;   // 11  MIM for Mailbox 11
    UINT16      MIM12: 1;   // 12  MIM for Mailbox 12
    UINT16      MIM13: 1;   // 13  MIM for Mailbox 13
    UINT16      MIM14: 1;   // 14  MIM for Mailbox 14
    UINT16      MIM15: 1;   // 15  MIM for Mailbox 15
    UINT16      MIM16: 1;   // 16  MIM for Mailbox 16
    UINT16      MIM17: 1;   // 17  MIM for Mailbox 17
    UINT16      MIM18: 1;   // 18  MIM for Mailbox 18
    UINT16      MIM19: 1;   // 19  MIM for Mailbox 19
    UINT16      MIM20: 1;   // 20  MIM for Mailbox 20
    UINT16      MIM21: 1;   // 21  MIM for Mailbox 21
    UINT16      MIM22: 1;   // 22  MIM for Mailbox 22
    UINT16      MIM23: 1;   // 23  MIM for Mailbox 23
    UINT16      MIM24: 1;   // 24  MIM for Mailbox 24
    UINT16      MIM25: 1;   // 25  MIM for Mailbox 25
    UINT16      MIM26: 1;   // 26  MIM for Mailbox 26
    UINT16      MIM27: 1;   // 27  MIM for Mailbox 27
    UINT16      MIM28: 1;   // 28  MIM for Mailbox 28
    UINT16      MIM29: 1;   // 29  MIM for Mailbox 29
    UINT16      MIM30: 1;   // 30  MIM for Mailbox 30
    UINT16      MIM31: 1;   // 31  MIM for Mailbox 31

};

/* Allow access to the bit fields or entire register */
union CANMIM_REG
{
    UINT32        all;
    struct CANMIM_BITS  bit;
};

/* eCAN Mailbox Interrupt Level register (CANMIL) bit definitions */
struct  CANMIL_BITS              // bit  description
{
    UINT16      MIL0: 1;    // 0   0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL1: 1;    // 1   0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL2: 1;    // 2   0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL3: 1;    // 3   0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL4: 1;    // 4   0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL5: 1;    // 5   0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL6: 1;    // 6   0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL7: 1;    // 7   0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL8: 1;    // 8   0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL9: 1;    // 9   0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL10: 1;   // 10  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL11: 1;   // 11  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL12: 1;   // 12  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL13: 1;   // 13  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL14: 1;   // 14  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL15: 1;   // 15  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL16: 1;   // 16  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL17: 1;   // 17  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL18: 1;   // 18  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL19: 1;   // 19  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL20: 1;   // 20  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL21: 1;   // 21  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL22: 1;   // 22  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL23: 1;   // 23  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL24: 1;   // 24  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL25: 1;   // 25  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL26: 1;   // 26  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL27: 1;   // 27  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL28: 1;   // 28  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL29: 1;   // 29  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL30: 1;   // 30  0 -> Int 9.5   1 -> Int 9.6
    UINT16      MIL31: 1;   // 31  0 -> Int 9.5   1 -> Int 9.6

