fduan001/F2812_SAMPLER/INCDIR/HF2812/DSP28_ECan.h
};

/* Allow access to the bit fields or entire register */
union CANMIL_REG
{
    UINT32        all;
    struct CANMIL_BITS  bit;
};


/* eCAN Overwrite Protection Control register (CANOPC) bit definitions */
struct  CANOPC_BITS              // bit  description
{
    UINT16      OPC0: 1;    // 0   OPC for Mailbox 0
    UINT16      OPC1: 1;    // 1   OPC for Mailbox 1
    UINT16      OPC2: 1;    // 2   OPC for Mailbox 2
    UINT16      OPC3: 1;    // 3   OPC for Mailbox 3
    UINT16      OPC4: 1;    // 4   OPC for Mailbox 4
    UINT16      OPC5: 1;    // 5   OPC for Mailbox 5
    UINT16      OPC6: 1;    // 6   OPC for Mailbox 6
    UINT16      OPC7: 1;    // 7   OPC for Mailbox 7
    UINT16      OPC8: 1;    // 8   OPC for Mailbox 8
    UINT16      OPC9: 1;    // 9   OPC for Mailbox 9
    UINT16      OPC10: 1;   // 10  OPC for Mailbox 10
    UINT16      OPC11: 1;   // 11  OPC for Mailbox 11
    UINT16      OPC12: 1;   // 12  OPC for Mailbox 12
    UINT16      OPC13: 1;   // 13  OPC for Mailbox 13
    UINT16      OPC14: 1;   // 14  OPC for Mailbox 14
    UINT16      OPC15: 1;   // 15  OPC for Mailbox 15
    UINT16      OPC16: 1;   // 16  OPC for Mailbox 16
    UINT16      OPC17: 1;   // 17  OPC for Mailbox 17
    UINT16      OPC18: 1;   // 18  OPC for Mailbox 18
    UINT16      OPC19: 1;   // 19  OPC for Mailbox 19
    UINT16      OPC20: 1;   // 20  OPC for Mailbox 20
    UINT16      OPC21: 1;   // 21  OPC for Mailbox 21
    UINT16      OPC22: 1;   // 22  OPC for Mailbox 22
    UINT16      OPC23: 1;   // 23  OPC for Mailbox 23
    UINT16      OPC24: 1;   // 24  OPC for Mailbox 24
    UINT16      OPC25: 1;   // 25  OPC for Mailbox 25
    UINT16      OPC26: 1;   // 26  OPC for Mailbox 26
    UINT16      OPC27: 1;   // 27  OPC for Mailbox 27
    UINT16      OPC28: 1;   // 28  OPC for Mailbox 28
    UINT16      OPC29: 1;   // 29  OPC for Mailbox 29
    UINT16      OPC30: 1;   // 30  OPC for Mailbox 30
    UINT16      OPC31: 1;   // 31  OPC for Mailbox 31

};

/* Allow access to the bit fields or entire register */
union CANOPC_REG
{
    UINT32        all;
    struct CANOPC_BITS  bit;
};


/* eCAN TX I/O Control Register (CANTIOC) bit definitions */
struct  CANTIOC_BITS             // bits  description
{
    UINT16      TXIN: 1;    // 0   TXIN
    UINT16      TXOUT: 1;   // 1   TXOUT
    UINT16      TXDIR: 1;   // 2   TXDIR
    UINT16      TXFUNC: 1;  // 3   TXFUNC
    UINT16 rsvd1: 12;       // 15:4   reserved
    UINT16 rsvd2: 16;       // 31:16   reserved
};

/* Allow access to the bit fields or entire register */
union CANTIOC_REG
{
    UINT32        all;
    struct CANTIOC_BITS  bit;
};

/* eCAN RX I/O Control Register (CANRIOC) bit definitions */
struct  CANRIOC_BITS             // bits  description
{
    UINT16      RXIN: 1;    // 0   RXIN
    UINT16      RXOUT: 1;   // 1   RXOUT
    UINT16      RXDIR: 1;   // 2   RXDIR
    UINT16      RXFUNC: 1;  // 3   RXFUNC
    UINT16 rsvd1: 12;       // 15:4   reserved
    UINT16 rsvd2: 16;       // 31:16   reserved
};

/* Allow access to the bit fields or entire register */
union CANRIOC_REG
{
    UINT32        all;
    struct CANRIOC_BITS  bit;
};


/* eCAN Local Network Timer register (CANLNT) bit definitions */
struct  CANLNT_BITS              // bit  description
{
    UINT16      LNT0: 1;    // 0   LNT for Mailbox 0
    UINT16      LNT1: 1;    // 1   LNT for Mailbox 1
    UINT16      LNT2: 1;    // 2   LNT for Mailbox 2
    UINT16      LNT3: 1;    // 3   LNT for Mailbox 3
    UINT16      LNT4: 1;    // 4   LNT for Mailbox 4
    UINT16      LNT5: 1;    // 5   LNT for Mailbox 5
    UINT16      LNT6: 1;    // 6   LNT for Mailbox 6
    UINT16      LNT7: 1;    // 7   LNT for Mailbox 7
    UINT16      LNT8: 1;    // 8   LNT for Mailbox 8
    UINT16      LNT9: 1;    // 9   LNT for Mailbox 9
    UINT16      LNT10: 1;   // 10  LNT for Mailbox 10
    UINT16      LNT11: 1;   // 11  LNT for Mailbox 11
    UINT16      LNT12: 1;   // 12  LNT for Mailbox 12
    UINT16      LNT13: 1;   // 13  LNT for Mailbox 13
    UINT16      LNT14: 1;   // 14  LNT for Mailbox 14
    UINT16      LNT15: 1;   // 15  LNT for Mailbox 15
    UINT16      LNT16: 1;   // 16  LNT for Mailbox 16
    UINT16      LNT17: 1;   // 17  LNT for Mailbox 17
    UINT16      LNT18: 1;   // 18  LNT for Mailbox 18
    UINT16      LNT19: 1;   // 19  LNT for Mailbox 19
    UINT16      LNT20: 1;   // 20  LNT for Mailbox 20
    UINT16      LNT21: 1;   // 21  LNT for Mailbox 21
    UINT16      LNT22: 1;   // 22  LNT for Mailbox 22
    UINT16      LNT23: 1;   // 23  LNT for Mailbox 23
    UINT16      LNT24: 1;   // 24  LNT for Mailbox 24
    UINT16      LNT25: 1;   // 25  LNT for Mailbox 25
    UINT16      LNT26: 1;   // 26  LNT for Mailbox 26
    UINT16      LNT27: 1;   // 27  LNT for Mailbox 27
    UINT16      LNT28: 1;   // 28  LNT for Mailbox 28
    UINT16      LNT29: 1;   // 29  LNT for Mailbox 29
    UINT16      LNT30: 1;   // 30  LNT for Mailbox 30
    UINT16      LNT31: 1;   // 31  LNT for Mailbox 31

};

/* Allow access to the bit fields or entire register */
union CANLNT_REG
{
    UINT32        all;
    struct CANLNT_BITS  bit;
};



/* eCAN Time-out Control register (CANTOC) bit definitions */
struct  CANTOC_BITS              // bit  description
{
    UINT16      TOC0: 1;    // 0   TOC for Mailbox 0
    UINT16      TOC1: 1;    // 1   TOC for Mailbox 1
    UINT16      TOC2: 1;    // 2   TOC for Mailbox 2
    UINT16      TOC3: 1;    // 3   TOC for Mailbox 3
    UINT16      TOC4: 1;    // 4   TOC for Mailbox 4
    UINT16      TOC5: 1;    // 5   TOC for Mailbox 5
    UINT16      TOC6: 1;    // 6   TOC for Mailbox 6
    UINT16      TOC7: 1;    // 7   TOC for Mailbox 7
    UINT16      TOC8: 1;    // 8   TOC for Mailbox 8
    UINT16      TOC9: 1;    // 9   TOC for Mailbox 9
    UINT16      TOC10: 1;   // 10  TOC for Mailbox 10
    UINT16      TOC11: 1;   // 11  TOC for Mailbox 11
    UINT16      TOC12: 1;   // 12  TOC for Mailbox 12
    UINT16      TOC13: 1;   // 13  TOC for Mailbox 13
    UINT16      TOC14: 1;   // 14  TOC for Mailbox 14
    UINT16      TOC15: 1;   // 15  TOC for Mailbox 15
    UINT16      TOC16: 1;   // 16  TOC for Mailbox 16
    UINT16      TOC17: 1;   // 17  TOC for Mailbox 17
    UINT16      TOC18: 1;   // 18  TOC for Mailbox 18
    UINT16      TOC19: 1;   // 19  TOC for Mailbox 19
    UINT16      TOC20: 1;   // 20  TOC for Mailbox 20
    UINT16      TOC21: 1;   // 21  TOC for Mailbox 21
    UINT16      TOC22: 1;   // 22  TOC for Mailbox 22
    UINT16      TOC23: 1;   // 23  TOC for Mailbox 23
    UINT16      TOC24: 1;   // 24  TOC for Mailbox 24
    UINT16      TOC25: 1;   // 25  TOC for Mailbox 25
    UINT16      TOC26: 1;   // 26  TOC for Mailbox 26
    UINT16      TOC27: 1;   // 27  TOC for Mailbox 27
    UINT16      TOC28: 1;   // 28  TOC for Mailbox 28
    UINT16      TOC29: 1;   // 29  TOC for Mailbox 29
    UINT16      TOC30: 1;   // 30  TOC for Mailbox 30
    UINT16      TOC31: 1;   // 31  TOC for Mailbox 31

