fduan001/F2812_SAMPLER/INCDIR/HF2812/DSP28_ECan.h
};

/* Allow access to the bit fields or entire register */
union CANTOC_REG
{
    UINT32        all;
    struct CANTOC_BITS  bit;
};


/* eCAN Time-out Status register (CANTOS) bit definitions */
struct  CANTOS_BITS              // bit  description
{
    UINT16      TOS0: 1;    // 0   TOS for Mailbox 0
    UINT16      TOS1: 1;    // 1   TOS for Mailbox 1
    UINT16      TOS2: 1;    // 2   TOS for Mailbox 2
    UINT16      TOS3: 1;    // 3   TOS for Mailbox 3
    UINT16      TOS4: 1;    // 4   TOS for Mailbox 4
    UINT16      TOS5: 1;    // 5   TOS for Mailbox 5
    UINT16      TOS6: 1;    // 6   TOS for Mailbox 6
    UINT16      TOS7: 1;    // 7   TOS for Mailbox 7
    UINT16      TOS8: 1;    // 8   TOS for Mailbox 8
    UINT16      TOS9: 1;    // 9   TOS for Mailbox 9
    UINT16      TOS10: 1;   // 10  TOS for Mailbox 10
    UINT16      TOS11: 1;   // 11  TOS for Mailbox 11
    UINT16      TOS12: 1;   // 12  TOS for Mailbox 12
    UINT16      TOS13: 1;   // 13  TOS for Mailbox 13
    UINT16      TOS14: 1;   // 14  TOS for Mailbox 14
    UINT16      TOS15: 1;   // 15  TOS for Mailbox 15
    UINT16      TOS16: 1;   // 16  TOS for Mailbox 16
    UINT16      TOS17: 1;   // 17  TOS for Mailbox 17
    UINT16      TOS18: 1;   // 18  TOS for Mailbox 18
    UINT16      TOS19: 1;   // 19  TOS for Mailbox 19
    UINT16      TOS20: 1;   // 20  TOS for Mailbox 20
    UINT16      TOS21: 1;   // 21  TOS for Mailbox 21
    UINT16      TOS22: 1;   // 22  TOS for Mailbox 22
    UINT16      TOS23: 1;   // 23  TOS for Mailbox 23
    UINT16      TOS24: 1;   // 24  TOS for Mailbox 24
    UINT16      TOS25: 1;   // 25  TOS for Mailbox 25
    UINT16      TOS26: 1;   // 26  TOS for Mailbox 26
    UINT16      TOS27: 1;   // 27  TOS for Mailbox 27
    UINT16      TOS28: 1;   // 28  TOS for Mailbox 28
    UINT16      TOS29: 1;   // 29  TOS for Mailbox 29
    UINT16      TOS30: 1;   // 30  TOS for Mailbox 30
    UINT16      TOS31: 1;   // 31  TOS for Mailbox 31

};

/* Allow access to the bit fields or entire register */
union CANTOS_REG
{
    UINT32        all;
    struct CANTOS_BITS  bit;
};

/**************************************/
/* eCAN Control & Status register file */
/**************************************/

struct ECAN_REGS
{
    union CANME_REG   CANME;          // Mailbox Enable
    union CANMD_REG   CANMD;          // Mailbox Direction
    union CANTRS_REG  CANTRS;         // Transmit Request Set
    union CANTRR_REG  CANTRR;         // Transmit Request Reset
    union CANTA_REG   CANTA;          // Transmit Acknowledge
    union CANAA_REG   CANAA;          // Abort Acknowledge
    union CANRMP_REG  CANRMP;         // Received Message Pending
    union CANRML_REG  CANRML;         // Received Message Lost
    union CANRFP_REG  CANRFP;         // Remote Frame Pending
    union CANGAM_REG  CANGAM;         // Global Acceptance Mask
    union CANMC_REG   CANMC;          // Master Control
    union CANBTC_REG  CANBTC;         // Bit Timing
    union CANES_REG   CANES;          // Error Status
    union CANTEC_REG  CANTEC;         // Transmit Error Counter
    union CANREC_REG  CANREC;         // Receive Error Counter
    union CANGIF0_REG CANGIF0;        // Global Interrupt Flag 0
    union CANGIM_REG  CANGIM;         // Global Interrupt Mask 0
    union CANGIF1_REG CANGIF1;        // Global Interrupt Flag 1
    union CANMIM_REG  CANMIM;         // Mailbox Interrupt Mask
    union CANMIL_REG  CANMIL;         // Mailbox Interrupt Level
    union CANOPC_REG  CANOPC;         // Overwrite Protection Control
    union CANTIOC_REG CANTIOC;        // TX I/O Control
    union CANRIOC_REG CANRIOC;        // RX I/O Control
    union CANLNT_REG  CANLNT;         // Local Network Time
    union CANTOC_REG  CANTOC;         // Time-out Control
    union CANTOS_REG  CANTOS;         // Time-out Status

};

/* --------------------------------------------------- */
/* eCAN Mailbox Registers                               */
/* ----------------------------------------------------*/

/* eCAN Message ID (MID) bit definitions */
struct  CANMID_BITS                  // bits  description
{
    UINT16      MSGID_L: 16;    // 0:15
    UINT16      MSGID_H: 13;    // 16:28
    UINT16      AAM: 1;         // 29
    UINT16      AME: 1;         // 30
    UINT16      IDE: 1;         // 31
};

/* Allow access to the bit fields or entire register */
union CANMID_REG
{
    UINT32        all;
    struct CANMID_BITS  bit;
};

/* eCAN Master Control Field (MCF) bit definitions */
struct  CANMCF_BITS                  // bits  description
{
    UINT16      DLC: 4;         // 0:3
    UINT16      RTR: 1;         // 4
    UINT16 rsvd1: 3;            // 7:5   reserved
    UINT16      TPL: 5;         // 12:8
    UINT16 rsvd2: 3;            // 15:13   reserved
    UINT16 rsvd3: 16;           // 31:16   reserved
};

/* Allow access to the bit fields or entire register */
union CANMCF_REG
{
    UINT32        all;
    struct CANMCF_BITS  bit;
};

/* eCAN Message Data Register low (MDR_L) bit definitions */
struct  CANMDRL_BITS                  // bits  description
{
    UINT16      LOW_WORD: 16;    // 0:15
    UINT16      HI_WORD: 16;     // 31:16
};

/* Allow access to the bit fields or entire register */
union CANMDRL_REG
{
    UINT32        all;
    struct CANMDRL_BITS  bit;
};

/* eCAN Message Data Register high  (MDR_H) bit definitions */
struct  CANMDRH_BITS                  // bits  description
{
    UINT16      LOW_WORD: 16;   // 0:15
    UINT16      HI_WORD: 16;    // 31:16
};

/* Allow access to the bit fields or entire register */
union CANMDRH_REG
{
    UINT32        all;
    struct CANMDRH_BITS  bit;
};

struct MBOX
{
    union CANMID_REG MID;
    union CANMCF_REG MCF;
    union CANMDRL_REG MDRL;
    union CANMDRH_REG MDRH;
};

/**************************************/
/*          eCAN Mailboxes             */
/**************************************/

struct ECAN_MBOXES
{
    struct MBOX MBOX0;
    struct MBOX MBOX1;
    struct MBOX MBOX2;
    struct MBOX MBOX3;
    struct MBOX MBOX4;
    struct MBOX MBOX5;
    struct MBOX MBOX6;
    struct MBOX MBOX7;
    struct MBOX MBOX8;
    struct MBOX MBOX9;
    struct MBOX MBOX10;
    struct MBOX MBOX11;
    struct MBOX MBOX12;
    struct MBOX MBOX13;
    struct MBOX MBOX14;
    struct MBOX MBOX15;
    struct MBOX MBOX16;
    struct MBOX MBOX17;
    struct MBOX MBOX18;
    struct MBOX MBOX19;
    struct MBOX MBOX20;
    struct MBOX MBOX21;
    struct MBOX MBOX22;
    struct MBOX MBOX23;
    struct MBOX MBOX24;
    struct MBOX MBOX25;
    struct MBOX MBOX26;
    struct MBOX MBOX27;
    struct MBOX MBOX28;
    struct MBOX MBOX29;
    struct MBOX MBOX30;
    struct MBOX MBOX31;
};

/* eCAN Local Acceptance Mask (LAM) bit definitions */
struct  CANLAM_BITS                  // bits  description
{
    UINT16      LAM_L: 16;    // 0:15
    UINT16      LAM_H: 13;    // 16:28
    UINT16 rsvd1: 2;          // 29:30   reserved
    UINT16      LAMI: 1;      // 31
};

/* Allow access to the bit fields or entire register */
union CANLAM_REG
{
    UINT32        all;
    struct CANLAM_BITS  bit;
};


/**************************************/
/*    eCAN Local Acceptance Masks      */
/**************************************/

