fduan001/F2812_SAMPLER/INCDIR/HF2812/DSP28_ECan.h
/* eCAN LAM File */
struct LAM_REGS
{
    union CANLAM_REG LAM0;
    union CANLAM_REG LAM1;
    union CANLAM_REG LAM2;
    union CANLAM_REG LAM3;
    union CANLAM_REG LAM4;
    union CANLAM_REG LAM5;
    union CANLAM_REG LAM6;
    union CANLAM_REG LAM7;
    union CANLAM_REG LAM8;
    union CANLAM_REG LAM9;
    union CANLAM_REG LAM10;
    union CANLAM_REG LAM11;
    union CANLAM_REG LAM12;
    union CANLAM_REG LAM13;
    union CANLAM_REG LAM14;
    union CANLAM_REG LAM15;
    union CANLAM_REG LAM16;
    union CANLAM_REG LAM17;
    union CANLAM_REG LAM18;
    union CANLAM_REG LAM19;
    union CANLAM_REG LAM20;
    union CANLAM_REG LAM21;
    union CANLAM_REG LAM22;
    union CANLAM_REG LAM23;
    union CANLAM_REG LAM24;
    union CANLAM_REG LAM25;
    union CANLAM_REG LAM26;
    union CANLAM_REG LAM27;
    union CANLAM_REG LAM28;
    union CANLAM_REG LAM29;
    union CANLAM_REG LAM30;
    union CANLAM_REG LAM31;
};

/* Mailbox MOTS File */

struct MOTS
{
    unsigned  long MOTS0;
    unsigned  long MOTS1;
    unsigned  long MOTS2;
    unsigned  long MOTS3;
    unsigned  long MOTS4;
    unsigned  long MOTS5;
    unsigned  long MOTS6;
    unsigned  long MOTS7;
    unsigned  long MOTS8;
    unsigned  long MOTS9;
    unsigned  long MOTS10;
    unsigned  long MOTS11;
    unsigned  long MOTS12;
    unsigned  long MOTS13;
    unsigned  long MOTS14;
    unsigned  long MOTS15;
    unsigned  long MOTS16;
    unsigned  long MOTS17;
    unsigned  long MOTS18;
    unsigned  long MOTS19;
    unsigned  long MOTS20;
    unsigned  long MOTS21;
    unsigned  long MOTS22;
    unsigned  long MOTS23;
    unsigned  long MOTS24;
    unsigned  long MOTS25;
    unsigned  long MOTS26;
    unsigned  long MOTS27;
    unsigned  long MOTS28;
    unsigned  long MOTS29;
    unsigned  long MOTS30;
    unsigned  long MOTS31;
};

/* Mailbox MOTO File */

struct MOTO
{
    unsigned  long MOTO0;
    unsigned  long MOTO1;
    unsigned  long MOTO2;
    unsigned  long MOTO3;
    unsigned  long MOTO4;
    unsigned  long MOTO5;
    unsigned  long MOTO6;
    unsigned  long MOTO7;
    unsigned  long MOTO8;
    unsigned  long MOTO9;
    unsigned  long MOTO10;
    unsigned  long MOTO11;
    unsigned  long MOTO12;
    unsigned  long MOTO13;
    unsigned  long MOTO14;
    unsigned  long MOTO15;
    unsigned  long MOTO16;
    unsigned  long MOTO17;
    unsigned  long MOTO18;
    unsigned  long MOTO19;
    unsigned  long MOTO20;
    unsigned  long MOTO21;
    unsigned  long MOTO22;
    unsigned  long MOTO23;
    unsigned  long MOTO24;
    unsigned  long MOTO25;
    unsigned  long MOTO26;
    unsigned  long MOTO27;
    unsigned  long MOTO28;
    unsigned  long MOTO29;
    unsigned  long MOTO30;
    unsigned  long MOTO31;
};


//---------------------------------------------------------------------------
// eCAN External References & Function Declarations:
//
extern volatile struct ECAN_REGS ECanaRegs;
extern volatile struct ECAN_MBOXES ECanaMboxes;

#endif  // end of DSP28_ECAN.H definition        

//===========================================================================
// No more.
//===========================================================================
